; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-96)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 - object)
 (:init 
    (arm-empty)
    (clear b5)
    (on b5 b7)
    (on-table b7)
    (clear b12)
    (on b12 b10)
    (on b10 b8)
    (on b8 b15)
    (on-table b15)
    (clear b21)
    (on b21 b22)
    (on b22 b16)
    (on b16 b23)
    (on-table b23)
    (clear b6)
    (on b6 b20)
    (on b20 b26)
    (on b26 b1)
    (on b1 b24)
    (on b24 b17)
    (on b17 b11)
    (on-table b11)
    (clear b19)
    (on b19 b18)
    (on b18 b13)
    (on b13 b28)
    (on b28 b4)
    (on b4 b27)
    (on b27 b14)
    (on b14 b25)
    (on b25 b3)
    (on b3 b9)
    (on-table b9)
    (clear b2)
    (on-table b2))
 (:goal (and 
(on-table b9)
(on b27 b16)
))
)

; plan
1. (unstack b19 b18)
   deleted: (on b19 b18) (clear b19) (arm-empty)
   added: (holding b19) (clear b18)
   goals met: 1 of 2
2. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 1 of 2
3. (unstack b18 b13)
   deleted: (on b18 b13) (clear b18) (arm-empty)
   added: (holding b18) (clear b13)
   goals met: 1 of 2
4. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 1 of 2
5. (unstack b13 b28)
   deleted: (on b13 b28) (clear b13) (arm-empty)
   added: (holding b13) (clear b28)
   goals met: 1 of 2
6. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 1 of 2
7. (unstack b28 b4)
   deleted: (on b28 b4) (clear b28) (arm-empty)
   added: (holding b28) (clear b4)
   goals met: 1 of 2
8. (putdown b28)
   deleted: (holding b28)
   added: (clear b28) (arm-empty) (on-table b28)
   goals met: 1 of 2
9. (unstack b21 b22)
   deleted: (on b21 b22) (clear b21) (arm-empty)
   added: (holding b21) (clear b22)
   goals met: 1 of 2
10. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 1 of 2
11. (unstack b4 b27)
   deleted: (on b4 b27) (clear b4) (arm-empty)
   added: (holding b4) (clear b27)
   goals met: 1 of 2
12. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 1 of 2
13. (unstack b22 b16)
   deleted: (on b22 b16) (clear b22) (arm-empty)
   added: (holding b22) (clear b16)
   goals met: 1 of 2
14. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 1 of 2
15. (unstack b27 b14)
   deleted: (on b27 b14) (clear b27) (arm-empty)
   added: (holding b27) (clear b14)
   goals met: 1 of 2
16. (stack b27 b16)
   deleted: (clear b16) (holding b27)
   added: (arm-empty) (clear b27) (on b27 b16)
   goals met: 2 of 2
